{"intents": [
    {
        "tag": "greetings",
        "patterns": ["hey", "hello", "hi", "good day", "good morning", "good afternoon", "good evening", "whats up?", "how is it going?", "how's it going?"],
        "responses": ["Hello! How can I help you today?"]
    },
    {
        "tag": "name",
        "patterns": ["What is your name", "whats your name", "who am i speaking to?", "who is this?", "are you a robot?", "are you a bot?"],
        "responses": ["My name is John, I'm the neural net chat bot to help customers find what they are looking for.", "My name is John, I'm a bot that will help you, or pass you over to a human to help."]
    },
    {
        "tag": "human",
        "patterns": ["can i speak to a human?", "can i speak to your manager?", "get me a manager", "manager", "human"],
        "responses": ["I will now connect you to a human. Could you please write your name, and email you wish to be contacted at in this chat. Thank you."]
    },
    {
        "tag": "help",
        "patterns": ["i need help", "can you tell me more about"],
        "responses": ["To get you the requested information, could you please type what you are looking for help with, I am programmed with information about the following: 'Subscriptions', 'Web Design', 'SEO', 'Payments', 'Membership', 'After Sales'. Alternatively if you would like to speak to a human, please type 'Human'. Thank you."]
    },
    {
        "tag": "payments",
        "patterns": ["payments", "payment", "What payment do you accept?", "what cards do you take?", "can i pay in installments?"],
        "responses": ["Our payment system uses Stripe for all of our payments. We can accept payments from all VISA, VISA Debit, Mastercard, Discover, and American Express"]
    },
    {
        "tag": "subscriptions",
        "patterns": ["How does the subscription work?", "why should i subscribe"],
        "responses": ["Our subscription service is the cornerstone of Manage My Web. This service aims to provide essentially an 'outsourced' development team, that is always on standby to provide updates, implement new SEO strategies and more. For full information on our subscription service, please visit the 'About' section of our website. Alternatively you can type 'Human' now to speak directly to one of our customer agents."]
    }
]}